7767517
247 269
Input            input                    0 1 input
Convolution      362                      1 1 input 362 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=648
BatchNorm        363                      1 1 362 363 0=24
ReLU             364                      1 1 363 364
Pooling          365                      1 1 364 365 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 365 365_splitncnn_0 365_splitncnn_1
ConvolutionDepthWise 366                      1 1 365_splitncnn_1 366 0=24 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=0 6=600 7=24
BatchNorm        367                      1 1 366 367 0=24
Convolution      368                      1 1 367 368 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=576
BatchNorm        369                      1 1 368 369 0=24
ReLU             370                      1 1 369 370
Convolution      371                      1 1 365_splitncnn_0 371 0=66 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1584
BatchNorm        372                      1 1 371 372 0=66
ReLU             373                      1 1 372 373
ConvolutionDepthWise 374                      1 1 373 374 0=66 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=0 6=1650 7=66
BatchNorm        375                      1 1 374 375 0=66
Convolution      376                      1 1 375 376 0=108 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=7128
BatchNorm        377                      1 1 376 377 0=108
ReLU             378                      1 1 377 378
Concat           379                      2 1 370 378 379 0=0
ShuffleChannel   418                      1 1 379 418 0=2 1=0
Split            splitncnn_1              1 2 418 418_splitncnn_0 418_splitncnn_1
Crop             419                      1 1 418_splitncnn_1 419 -23309=1,0 -23310=1,66 -23311=1,0
Crop             420                      1 1 418_splitncnn_0 420 -23309=1,66 -23310=1,2147483647 -23311=1,0
Convolution      421                      1 1 420 421 0=66 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4356
BatchNorm        422                      1 1 421 422 0=66
ReLU             423                      1 1 422 423
ConvolutionDepthWise 424                      1 1 423 424 0=66 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=1650 7=66
BatchNorm        425                      1 1 424 425 0=66
Convolution      426                      1 1 425 426 0=66 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4356
BatchNorm        427                      1 1 426 427 0=66
ReLU             428                      1 1 427 428
Concat           429                      2 1 419 428 429 0=0
ShuffleChannel   468                      1 1 429 468 0=2 1=0
Split            splitncnn_2              1 2 468 468_splitncnn_0 468_splitncnn_1
Crop             469                      1 1 468_splitncnn_1 469 -23309=1,0 -23310=1,66 -23311=1,0
Crop             470                      1 1 468_splitncnn_0 470 -23309=1,66 -23310=1,2147483647 -23311=1,0
Convolution      471                      1 1 470 471 0=66 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4356
BatchNorm        472                      1 1 471 472 0=66
ReLU             473                      1 1 472 473
ConvolutionDepthWise 474                      1 1 473 474 0=66 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=1650 7=66
BatchNorm        475                      1 1 474 475 0=66
Convolution      476                      1 1 475 476 0=66 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4356
BatchNorm        477                      1 1 476 477 0=66
ReLU             478                      1 1 477 478
Concat           479                      2 1 469 478 479 0=0
ShuffleChannel   518                      1 1 479 518 0=2 1=0
Split            splitncnn_3              1 2 518 518_splitncnn_0 518_splitncnn_1
Crop             519                      1 1 518_splitncnn_1 519 -23309=1,0 -23310=1,66 -23311=1,0
Crop             520                      1 1 518_splitncnn_0 520 -23309=1,66 -23310=1,2147483647 -23311=1,0
Convolution      521                      1 1 520 521 0=66 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4356
BatchNorm        522                      1 1 521 522 0=66
ReLU             523                      1 1 522 523
ConvolutionDepthWise 524                      1 1 523 524 0=66 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=1650 7=66
BatchNorm        525                      1 1 524 525 0=66
Convolution      526                      1 1 525 526 0=66 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4356
BatchNorm        527                      1 1 526 527 0=66
ReLU             528                      1 1 527 528
Concat           529                      2 1 519 528 529 0=0
Split            splitncnn_4              1 2 529 529_splitncnn_0 529_splitncnn_1
ConvolutionDepthWise 530                      1 1 529_splitncnn_1 530 0=132 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=0 6=3300 7=132
BatchNorm        531                      1 1 530 531 0=132
Convolution      532                      1 1 531 532 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        533                      1 1 532 533 0=132
ReLU             534                      1 1 533 534
Convolution      535                      1 1 529_splitncnn_0 535 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        536                      1 1 535 536 0=132
ReLU             537                      1 1 536 537
ConvolutionDepthWise 538                      1 1 537 538 0=132 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=0 6=3300 7=132
BatchNorm        539                      1 1 538 539 0=132
Convolution      540                      1 1 539 540 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        541                      1 1 540 541 0=132
ReLU             542                      1 1 541 542
Concat           543                      2 1 534 542 543 0=0
ShuffleChannel   582                      1 1 543 582 0=2 1=0
Split            splitncnn_5              1 2 582 582_splitncnn_0 582_splitncnn_1
Crop             583                      1 1 582_splitncnn_1 583 -23309=1,0 -23310=1,132 -23311=1,0
Crop             584                      1 1 582_splitncnn_0 584 -23309=1,132 -23310=1,2147483647 -23311=1,0
Convolution      585                      1 1 584 585 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        586                      1 1 585 586 0=132
ReLU             587                      1 1 586 587
ConvolutionDepthWise 588                      1 1 587 588 0=132 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3300 7=132
BatchNorm        589                      1 1 588 589 0=132
Convolution      590                      1 1 589 590 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        591                      1 1 590 591 0=132
ReLU             592                      1 1 591 592
Concat           593                      2 1 583 592 593 0=0
ShuffleChannel   632                      1 1 593 632 0=2 1=0
Split            splitncnn_6              1 2 632 632_splitncnn_0 632_splitncnn_1
Crop             633                      1 1 632_splitncnn_1 633 -23309=1,0 -23310=1,132 -23311=1,0
Crop             634                      1 1 632_splitncnn_0 634 -23309=1,132 -23310=1,2147483647 -23311=1,0
Convolution      635                      1 1 634 635 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        636                      1 1 635 636 0=132
ReLU             637                      1 1 636 637
ConvolutionDepthWise 638                      1 1 637 638 0=132 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3300 7=132
BatchNorm        639                      1 1 638 639 0=132
Convolution      640                      1 1 639 640 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        641                      1 1 640 641 0=132
ReLU             642                      1 1 641 642
Concat           643                      2 1 633 642 643 0=0
ShuffleChannel   682                      1 1 643 682 0=2 1=0
Split            splitncnn_7              1 2 682 682_splitncnn_0 682_splitncnn_1
Crop             683                      1 1 682_splitncnn_1 683 -23309=1,0 -23310=1,132 -23311=1,0
Crop             684                      1 1 682_splitncnn_0 684 -23309=1,132 -23310=1,2147483647 -23311=1,0
Convolution      685                      1 1 684 685 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        686                      1 1 685 686 0=132
ReLU             687                      1 1 686 687
ConvolutionDepthWise 688                      1 1 687 688 0=132 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3300 7=132
BatchNorm        689                      1 1 688 689 0=132
Convolution      690                      1 1 689 690 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        691                      1 1 690 691 0=132
ReLU             692                      1 1 691 692
Concat           693                      2 1 683 692 693 0=0
ShuffleChannel   732                      1 1 693 732 0=2 1=0
Split            splitncnn_8              1 2 732 732_splitncnn_0 732_splitncnn_1
Crop             733                      1 1 732_splitncnn_1 733 -23309=1,0 -23310=1,132 -23311=1,0
Crop             734                      1 1 732_splitncnn_0 734 -23309=1,132 -23310=1,2147483647 -23311=1,0
Convolution      735                      1 1 734 735 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        736                      1 1 735 736 0=132
ReLU             737                      1 1 736 737
ConvolutionDepthWise 738                      1 1 737 738 0=132 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3300 7=132
BatchNorm        739                      1 1 738 739 0=132
Convolution      740                      1 1 739 740 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        741                      1 1 740 741 0=132
ReLU             742                      1 1 741 742
Concat           743                      2 1 733 742 743 0=0
ShuffleChannel   782                      1 1 743 782 0=2 1=0
Split            splitncnn_9              1 2 782 782_splitncnn_0 782_splitncnn_1
Crop             783                      1 1 782_splitncnn_1 783 -23309=1,0 -23310=1,132 -23311=1,0
Crop             784                      1 1 782_splitncnn_0 784 -23309=1,132 -23310=1,2147483647 -23311=1,0
Convolution      785                      1 1 784 785 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        786                      1 1 785 786 0=132
ReLU             787                      1 1 786 787
ConvolutionDepthWise 788                      1 1 787 788 0=132 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3300 7=132
BatchNorm        789                      1 1 788 789 0=132
Convolution      790                      1 1 789 790 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        791                      1 1 790 791 0=132
ReLU             792                      1 1 791 792
Concat           793                      2 1 783 792 793 0=0
ShuffleChannel   832                      1 1 793 832 0=2 1=0
Split            splitncnn_10             1 2 832 832_splitncnn_0 832_splitncnn_1
Crop             833                      1 1 832_splitncnn_1 833 -23309=1,0 -23310=1,132 -23311=1,0
Crop             834                      1 1 832_splitncnn_0 834 -23309=1,132 -23310=1,2147483647 -23311=1,0
Convolution      835                      1 1 834 835 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        836                      1 1 835 836 0=132
ReLU             837                      1 1 836 837
ConvolutionDepthWise 838                      1 1 837 838 0=132 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3300 7=132
BatchNorm        839                      1 1 838 839 0=132
Convolution      840                      1 1 839 840 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        841                      1 1 840 841 0=132
ReLU             842                      1 1 841 842
Concat           843                      2 1 833 842 843 0=0
ShuffleChannel   882                      1 1 843 882 0=2 1=0
Split            splitncnn_11             1 2 882 882_splitncnn_0 882_splitncnn_1
Crop             883                      1 1 882_splitncnn_1 883 -23309=1,0 -23310=1,132 -23311=1,0
Crop             884                      1 1 882_splitncnn_0 884 -23309=1,132 -23310=1,2147483647 -23311=1,0
Convolution      885                      1 1 884 885 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        886                      1 1 885 886 0=132
ReLU             887                      1 1 886 887
ConvolutionDepthWise 888                      1 1 887 888 0=132 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3300 7=132
BatchNorm        889                      1 1 888 889 0=132
Convolution      890                      1 1 889 890 0=132 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17424
BatchNorm        891                      1 1 890 891 0=132
ReLU             892                      1 1 891 892
Concat           893                      2 1 883 892 893 0=0
Split            splitncnn_12             1 3 893 893_splitncnn_0 893_splitncnn_1 893_splitncnn_2
ConvolutionDepthWise 894                      1 1 893_splitncnn_2 894 0=264 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=0 6=6600 7=264
BatchNorm        895                      1 1 894 895 0=264
Convolution      896                      1 1 895 896 0=264 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=69696
BatchNorm        897                      1 1 896 897 0=264
ReLU             898                      1 1 897 898
Convolution      899                      1 1 893_splitncnn_1 899 0=264 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=69696
BatchNorm        900                      1 1 899 900 0=264
ReLU             901                      1 1 900 901
ConvolutionDepthWise 902                      1 1 901 902 0=264 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=0 6=6600 7=264
BatchNorm        903                      1 1 902 903 0=264
Convolution      904                      1 1 903 904 0=264 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=69696
BatchNorm        905                      1 1 904 905 0=264
ReLU             906                      1 1 905 906
Concat           907                      2 1 898 906 907 0=0
ShuffleChannel   946                      1 1 907 946 0=2 1=0
Split            splitncnn_13             1 2 946 946_splitncnn_0 946_splitncnn_1
Crop             947                      1 1 946_splitncnn_1 947 -23309=1,0 -23310=1,264 -23311=1,0
Crop             948                      1 1 946_splitncnn_0 948 -23309=1,264 -23310=1,2147483647 -23311=1,0
Convolution      949                      1 1 948 949 0=264 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=69696
BatchNorm        950                      1 1 949 950 0=264
ReLU             951                      1 1 950 951
ConvolutionDepthWise 952                      1 1 951 952 0=264 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=6600 7=264
BatchNorm        953                      1 1 952 953 0=264
Convolution      954                      1 1 953 954 0=264 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=69696
BatchNorm        955                      1 1 954 955 0=264
ReLU             956                      1 1 955 956
Concat           957                      2 1 947 956 957 0=0
ShuffleChannel   996                      1 1 957 996 0=2 1=0
Split            splitncnn_14             1 2 996 996_splitncnn_0 996_splitncnn_1
Crop             997                      1 1 996_splitncnn_1 997 -23309=1,0 -23310=1,264 -23311=1,0
Crop             998                      1 1 996_splitncnn_0 998 -23309=1,264 -23310=1,2147483647 -23311=1,0
Convolution      999                      1 1 998 999 0=264 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=69696
BatchNorm        1000                     1 1 999 1000 0=264
ReLU             1001                     1 1 1000 1001
ConvolutionDepthWise 1002                     1 1 1001 1002 0=264 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=6600 7=264
BatchNorm        1003                     1 1 1002 1003 0=264
Convolution      1004                     1 1 1003 1004 0=264 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=69696
BatchNorm        1005                     1 1 1004 1005 0=264
ReLU             1006                     1 1 1005 1006
Concat           1007                     2 1 997 1006 1007 0=0
ShuffleChannel   1046                     1 1 1007 1046 0=2 1=0
Split            splitncnn_15             1 2 1046 1046_splitncnn_0 1046_splitncnn_1
Crop             1047                     1 1 1046_splitncnn_1 1047 -23309=1,0 -23310=1,264 -23311=1,0
Crop             1048                     1 1 1046_splitncnn_0 1048 -23309=1,264 -23310=1,2147483647 -23311=1,0
Convolution      1049                     1 1 1048 1049 0=264 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=69696
BatchNorm        1050                     1 1 1049 1050 0=264
ReLU             1051                     1 1 1050 1051
ConvolutionDepthWise 1052                     1 1 1051 1052 0=264 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=6600 7=264
BatchNorm        1053                     1 1 1052 1053 0=264
Convolution      1054                     1 1 1053 1054 0=264 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=69696
BatchNorm        1055                     1 1 1054 1055 0=264
ReLU             1056                     1 1 1055 1056
Concat           1057                     2 1 1047 1056 1057 0=0
Split            splitncnn_16             1 2 1057 1057_splitncnn_0 1057_splitncnn_1
Pooling          1058                     1 1 1057_splitncnn_1 1058 0=1 4=1
Convolution      1059                     1 1 893_splitncnn_0 1059 0=245 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64680
Convolution      1060                     1 1 1057_splitncnn_0 1060 0=245 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=129360
Interp           1077                     1 1 1060 1077 0=1 1=2.000000e+00 2=2.000000e+00
Convolution      1078                     1 1 1058 1078 0=245 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=129360
BinaryOp         1079                     2 1 1059 1077 1079 0=0
BinaryOp         1080                     2 1 1079 1078 1080 0=0
Split            splitncnn_17             1 2 1080 1080_splitncnn_0 1080_splitncnn_1
ConvolutionDepthWise 1081                     1 1 1080_splitncnn_1 1081 0=245 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=6125 7=245
BatchNorm        1082                     1 1 1081 1082 0=245
ReLU             1083                     1 1 1082 1083
Convolution      1084                     1 1 1083 1084 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=62720
BatchNorm        1085                     1 1 1084 1085 0=256
ReLU             1086                     1 1 1085 1086
Split            splitncnn_18             1 3 1086 1086_splitncnn_0 1086_splitncnn_1 1086_splitncnn_2
Convolution      1087                     1 1 1086_splitncnn_2 1087 0=50 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
Reshape          1101                     1 1 1087 1101 0=20 1=500 2=2
UnaryOp          1102                     1 1 1101 1102 0=7
Split            splitncnn_19             1 2 1102 1102_splitncnn_0 1102_splitncnn_1
Reduction        1103                     1 1 1102_splitncnn_1 1103 0=0 1=0 -23303=1,1 4=1
BinaryOp         1104                     2 1 1102_splitncnn_0 1103 1104 0=3
Reshape          rpn_cls_prob             1 1 1104 rpn_cls_prob 0=20 1=20 2=50
Convolution      rpn_bbox_pred            1 1 1086_splitncnn_1 rpn_bbox_pred 0=100 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=25600
Convolution      1120                     1 1 1086_splitncnn_0 1120 0=245 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=62720
BatchNorm        1121                     1 1 1120 1121 0=245
Sigmoid          1122                     1 1 1121 1122
BinaryOp         base_feat                2 1 1080_splitncnn_0 1122 base_feat 0=2
